ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
    // Persistent buffer to accumulate fragmented data
    static uint8_t temp_buffer[TEMP_BUFFER_SIZE_U32];
    static size_t temp_buffer_len = 0;

    for (;;) {
        // Wait for a UART event
        if (xQueueReceive(s_uart_queue, (void *)&event, (TickType_t)portMAX_DELAY)) {
            
            ActiveSerial->println("UART event triggered");

            switch (event.type) {
                case UART_PATTERN_DET: {

                    ActiveSerial->println("EOF1 detected");

                    // // Read all available new data from the hardware buffer
                    // uint8_t incoming_data[UART_RX_BUF_SIZE_U32];
                    // size_t buffered_size;
                    // uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
                    // int read_len = uart_read_bytes(UART_NUM_0, incoming_data, buffered_size, pdMS_TO_TICKS(100));

                    // if (read_len > 0) {
                    //     // --- 1. Append new data, checking for overflow ---
                    //     if (temp_buffer_len + read_len > TEMP_BUFFER_SIZE_U32) {
                    //         ActiveSerial->println("ERROR: UART temporary buffer overflow. Discarding all data.");
                    //         temp_buffer_len = 0; // Reset the buffer
                    //         break; 
                    //     }
                    //     memcpy(&temp_buffer[temp_buffer_len], incoming_data, read_len);
                    //     temp_buffer_len += read_len;

                    //     // --- 2. Scan buffer for complete packets and process them ---
                    //     if (temp_buffer[temp_buffer_len-2] == EOF_BYTE_0_U8 && temp_buffer[temp_buffer_len-1] == EOF_BYTE_1_U8) {
                            

                    //         // --- 3. Extract the packet and send it to the queue ---
                    //         UartPacket_t packet_to_send;
                    //         packet_to_send.len = temp_buffer_len;
                    //         memcpy(packet_to_send.data, temp_buffer, temp_buffer_len);
                    //         xQueueSend(s_serial_packet_queue, &packet_to_send, (TickType_t)0);

                    //         // --- 4. Remove the processed packet by shifting the buffer ---
                    //         size_t remaining_len = 0;//temp_buffer_len - packet_len;
                    //         temp_buffer_len = remaining_len;
                    //     }
                    //   }
                    }
                    break;
                

                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    ActiveSerial->println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    ActiveSerial->println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif

class NonBlockingStreamWrapper : public Stream {
private:
    Stream* target;
public:
    NonBlockingStreamWrapper(Stream* target) : target(target) {}
    int available() override { return target->available(); }
    int read() override { return target->read(); }
    int peek() override { return target->peek(); }
    void flush() override { target->flush(); }
    
    size_t write(uint8_t c) override {
        // DER MAGISCHE FIX: Ist überhaupt ein Terminal offen?
        if (!Serial) return 1; // Nein? Daten direkt verwerfen.

        if (target->availableForWrite() > 0) {
            return target->write(c);
        }
        return 1;
    }
    
    size_t write(const uint8_t *buffer, size_t size) override {
        if (size == 0) return 0;
        
        // DER MAGISCHE FIX: Ist überhaupt ein Terminal offen?
        if (!Serial) return size; // So tun, als wäre alles gesendet worden!

        int avail = target->availableForWrite();
        if (avail > 0) {
            size_t toWrite = (size < (size_t)avail) ? size : (size_t)avail;
            target->write(buffer, toWrite);
        }
        return size; 
    }
    
    int availableForWrite() override { 
        if (!Serial) return 0;
        return target->availableForWrite(); 
    }
};

void setup()
{

  

  #ifdef DEBUG_KEEP_USB_SERIAL_JTAG
    // For ESP32-S3, the USB Serial is shared with JTAG. To allow debugging via JTAG while also using Serial for output, we can delay the start of Serial until after the debugger has had time to connect.
    // This is a workaround to ensure that the USB Serial doesn't interfere with JTAG debugging during startup. 
    delay(5000); // Gibt dem Debugger 5 Sekunden Zeit, sich in Ruhe zu verbinden!
  #endif

  // stabilize RS232 pins, so servo doesnt go into alarm on startup
  pinMode(ISV57_TXPIN, OUTPUT);
  digitalWrite(ISV57_TXPIN, HIGH); // HIGH ist der Idle-State für UART

  // disable WIFI & Bluetooth to improve loadcell reading. 
  // HINT: The ESP32 S3 zero board doen't have strong 5V signal smoothing hardware as the regular S3 devboard. 
  #ifdef WIFI_DISABLE
    WiFi.mode(WIFI_OFF);
    btStop();
  #endif

  DapConfig_t dap_config_st_local;
  DapConfig_t dap_config_st_eeprom;

  // setup serial

  #ifdef USE_VENDOR_HID
    SetupVendorHID();
  #endif

  // #define USE_CDC_INSTEAD_OF_UART
  #ifdef USE_CDC_INSTEAD_OF_UART
    #ifdef USE_VENDOR_HID
      // PCB_VERSION=14 (S3-Zero): data exchange via vendor HID, CDC used for debug only.
      // enableReboot(false) prevents Windows CDC driver from triggering RESTART_BOOTLOADER:
      // any SET_LINE_CODING at 1200 bps fires usb_persist_restart() regardless of DTR state.
      // Upload via 1200bps-touch is therefore disabled; use manual BOOT+RESET instead.
      // SetupController_USB() (with VID/PID and proper product name) is called later once the
      // config (pedal type) is loaded, same as all other board variants.
      Serial.enableReboot(false);
      // CDC was already started by ARDUINO_USB_CDC_ON_BOOT=1 before setup(). 
      // Serial.begin() would trigger a second detach/attach corrupting the CDC RX endpoint.
      // Do NOT call Serial.begin() here. setTxTimeoutMs is safe to call at any time.
      // Use timeout=0: TX writes are guarded by availableForWrite() in the TX task, so
      // blocking is never needed. Without timeout=0, a write that slips past the guard
      // (e.g. debug println) would block for up to the old timeout and stall the system.
      Serial.setTxTimeoutMs(1);
      // ActiveSerial = &Serial;
      ActiveSerial = new NonBlockingStreamWrapper(&Serial);
    #else
      // Standard CDC path for other boards.
      #ifdef USB_JOYSTICK
        SetupController();
      #endif
      Serial.begin(DEFAULT_BAUD_U32);
      Serial.enableReboot(false);
      // Wait until the host opens the COM port (up to 3s)
      uint32_t timeout = millis();
      while (!Serial && (millis() - timeout < 3000)) {
        delay(10);
      }
      delay(500); // Give windows a small amount of time to breathe
      Serial.setTxTimeoutMs(100);
      // ActiveSerial = &Serial;
      ActiveSerial = new NonBlockingStreamWrapper(&Serial);
    #endif
  #elif CONFIG_IDF_TARGET_ESP32S3
    Serial1.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    // Serial.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial1;
  #elif CONFIG_IDF_TARGET_ESP32
    Serial.begin(DEFAULT_BAUD_U32);
    // Serial.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial;
  #endif





  // ADD THIS: Create the queue before creating the tasks that use it.
  // The queue can hold up to N state packages.
  // Depth = 200: holds 50 ms of 4 kHz production (4000 × 0.05 = 200 items)
  // giving ample margin even if the TX task is briefly delayed by USB activity.
  s_pedalStateQueue = xQueueCreate(200, sizeof(PedalStatePackage_t));
  if (s_pedalStateQueue == NULL)
  {
    ActiveSerial->println("Error creating the pedal state queue!");
  }
  s_joystickDataQueue = xQueueCreate(1, sizeof(joystickDataPackage_t));
  if (s_joystickDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the joystick data queue!");
  }
  s_loadcellDataQueue = xQueueCreate(1, sizeof(loadcellDataPackage_t));
  if (s_loadcellDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the joystick data queue!");
  }
  s_configUpdateAvailableQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateAvailableQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToPedalUpdateTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToPedalUpdateTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToLoadcellTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToLoadcellTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  // configUpdateSendToJoystickTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  // if (configUpdateSendToJoystickTaskQueue == NULL) {
  //     ActiveSerial->println("Error creating the config data queue!");
  // }
  s_configUpdateSendToSerialRXTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToSerialRXTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_actionCommandQueue = xQueueCreate(10, sizeof(DapActions_t));
  if (s_actionCommandQueue == NULL)
  {
    ActiveSerial->println("Error creating the action command queue!");
  }
  s_systemControlQueue = xQueueCreate(5, sizeof(uint8_t));
  if (s_systemControlQueue == NULL)
  {
    ActiveSerial->println("Error creating the system control queue!");
  }



  xTaskCreatePinnedToCore(
                    configHandlingTask,   /* Task function. */
                    "configHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_configHandlingTask,      /* Task handle to keep track of created task */
                    CORE_ID_CONFIG_HANDLING_TASK_U8);          /* pin task to core 1 */  

  

  

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN_U8
    pinMode(BRAKE_RESISTOR_PIN_U8, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN_U8, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN_U8
    pinMode(EMERGENCY_PIN_U8,INPUT_PULLUP);
  #endif

  

