ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  // set brake resistor voltage
  float servoOperationVoltageInVolt_fl32 = stepper->getBrakeResistorActivationVoltage();
  brakeController.setVoltageThreshold(servoOperationVoltageInVolt_fl32);


  Buzzer.InitializedSound((int)dap_config_st_local.payloadPedalConfig_st.pedalType_u8);

}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters(const DapConfig_t& newConfig)
{
  DapConfig_t dap_config_st_local;  
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payloadPedalConfig_st.pedalStartPosition_u8, dap_config_st_local.payloadPedalConfig_st.pedalEndPosition_u8);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  // tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/

void printTaskStats() {
    // Static variables to persist between calls
    static TaskStatus_t *pxPreviousTaskArray = NULL;
    static uint32_t ulPreviousTotalRunTime = 0;
    static UBaseType_t uxPreviousArraySize = 0;

    TaskStatus_t *pxCurrentTaskArray;
    volatile UBaseType_t uxCurrentArraySize;
    uint32_t ulCurrentTotalRunTime;

    // Allocate memory for the current snapshot
    uxCurrentArraySize = uxTaskGetNumberOfTasks();
    pxCurrentTaskArray = (TaskStatus_t *)pvPortMalloc(uxCurrentArraySize * sizeof(TaskStatus_t));

    // Get the current system state
    if (pxCurrentTaskArray != NULL) {
        uxCurrentArraySize = uxTaskGetSystemState(pxCurrentTaskArray, uxCurrentArraySize, &ulCurrentTotalRunTime);

        // Check if this is the first run
        if (pxPreviousTaskArray != NULL) {
            // Calculate the time difference over the last second
            uint32_t ulTotalRunTimeDelta = ulCurrentTotalRunTime - ulPreviousTotalRunTime;

            if (ulTotalRunTimeDelta > 0) {
                ActiveSerial->println("\n--- Task CPU Usage (Last Second) ---");
                ActiveSerial->printf("%-25s %10s %15s %14s %30s\n", "Task", "Core ID", "Runtime [us]", "CPU %", "Free stack space [byte]");

                for (uint8_t coreIdx = 0; coreIdx < 2; coreIdx++)
                {

                  for (UBaseType_t i = 0; i < uxCurrentArraySize; i++) {

                      if (pxCurrentTaskArray[i].xCoreID == coreIdx)
                      {
                        // Find the matching task in the previous snapshot
                        for (UBaseType_t j = 0; j < uxPreviousArraySize; j++) {
                            if (pxCurrentTaskArray[i].xHandle == pxPreviousTaskArray[j].xHandle) {
                                uint32_t ulRunTimeDelta = pxCurrentTaskArray[i].ulRunTimeCounter - pxPreviousTaskArray[j].ulRunTimeCounter;
                                float cpuPercent = (100.0f * (float)ulRunTimeDelta) / (float)ulTotalRunTimeDelta;

                                ActiveSerial->printf("%-25s %10lu %15lu %14.2f %30lu\n",
                                  pxCurrentTaskArray[i].pcTaskName,
                                  pxCurrentTaskArray[i].xCoreID,
                                  (unsigned long)ulRunTimeDelta,
                                  cpuPercent,
                                  pxCurrentTaskArray[i].usStackHighWaterMark);
                                break;
                            }
                        }
                      }
                  }


                }

                
                ActiveSerial->println("-----------------------\n");
            }
        }

        // Free the previous snapshot and save the current one for the next cycle
        if (pxPreviousTaskArray != NULL)
        {
            vPortFree(pxPreviousTaskArray);
        }
        pxPreviousTaskArray = pxCurrentTaskArray;
        ulPreviousTotalRunTime = ulCurrentTotalRunTime;
        uxPreviousArraySize = uxCurrentArraySize;
    }
    else
    {
        ActiveSerial->println("Failed to allocate memory for task stats.");
    }
}

void profilerTask( void * pvParameters )
{
  for (;;)
  {
    // copy global struct to local for faster and safe executiion
    DapConfig_t dap_config_profilerTask_st;
    global_dap_config_class.getConfig(&dap_config_profilerTask_st, 500);

    // activate profiler depending on pedal config
    if (dap_config_profilerTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_NET_RUNTIME_U8) 
    {
      printTaskStats();
    }


    delay(5000);
    taskYIELD();
  }
}


void loop() {
  // vTaskDelete(NULL);  // Kill the Arduino loop task

  delay(5000);
  taskYIELD();
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
//#define ESPNow_debug_rudder

#ifdef ESPNow_debug_rudder
  unsigned long debugMessageLast=0;
#endif 

void IRAM_ATTR_FLAG pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DapStateExtended_t dap_state_extended_st_lcl_pedalUpdateTask;
  static DRAM_ATTR DapStateBasic_t dap_state_basic_st_lcl_pedalUpdateTask;
  static DRAM_ATTR DapConfig_t dap_config_pedalUpdateTask_st;

  static loadcellDataPackage_t loadcellDataReceived_st;
  static configDataPackage_t configPackage_st;

  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");

  static DRAM_ATTR float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0.0f;
  static DRAM_ATTR float filteredReading = 0.0f;

