ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  unsigned long servoActionLast = millis();
  

  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;


  float effect_force_fl32;
  float effect_pos_fl32;
  EffectOffsets_t effectOffsets_st;
  EndstopBehavior_t endstopBehavior_st; 
  RudderOffsets_t rudderOffsets_st;
  int32_t Position_effect;
  int32_t bpTriggerValue_u8;
  int32_t BP_trigger_min;
  int32_t BP_trigger_max;
  int32_t Position_check;
  int32_t Rudder_real_poisiton;
  float joystickNormalizedToInt32_orig;
  float joystickfrac;
  float joystickNormalizedToInt32_eval;
  uint16_t joystickNormalizedToUInt16 = 0;
  int32_t ABS_trigger_value;

  uint8_t sendPedalStructsViaSerialCounter_u8 = 0;
  uint8_t sendJoystickDataCounter_u8 = 0;

  
  global_dap_config_class.getConfig(&dap_config_pedalUpdateTask_st, 500);

  static const uint8_t joystickSendCounterMax_u8 = (REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US_I64) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) ;
  static const uint8_t serialSendCounterMax_u8 = (REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US_I64) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) ;

  
  

  
  static float changeVelocity = 0.0f;
  static float normalizedPedalReading_fl32 = 0.0f;
  static float stepperPosFraction_fl32 = 0.0f;
  static bool sendBasicFlag_b = false;
  static bool sendExtendedFlag_b = false;
  static int32_t stepperPosCurrent_i32;
  static uint32_t cycleCount_u32 = 0;
  
  bool local_systemIdentificationMode_b = false;
  bool local_OTA_status_b = false;

  AdmittanceDebugState_t admittanceDebugInfo_st;
  AdmittanceStates_t admittanceStates_st;
  
  for (;;)
  {


    // trigger task 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      DapActions_t incomingAction;
      if (xQueueReceive(s_actionCommandQueue, &incomingAction, 0) == pdPASS) {
        if (incomingAction.payloadPedalAction_st.triggerAbs_u8 > 0) {
          absOscillation.trigger();
          dap_calculationVariables_st.trackCondition_u8 =
              (incomingAction.payloadPedalAction_st.triggerAbs_u8 > 1)
              ? (incomingAction.payloadPedalAction_st.triggerAbs_u8 - 1) : 0;
        }
        _RPMOscillation.rpmValue_fl32 = incomingAction.payloadPedalAction_st.rpm_u8;
        gForceEffect_.gValue_fl32     = incomingAction.payloadPedalAction_st.gValue_u8 - 128;
        if (incomingAction.payloadPedalAction_st.wheelSlip_u8) _WSOscillation.trigger();
        if (!dap_calculationVariables_st.rudderStatus_b) {
          roadImpactEffect_.roadImpactValue_u8 = incomingAction.payloadPedalAction_st.impactValue_u8;
        }
        if (incomingAction.payloadPedalAction_st.startSystemIdentification_u8) {
          local_systemIdentificationMode_b = true;
        }
        if (incomingAction.payloadPedalAction_st.triggerCv1_u8) customVibration1_.trigger();
        if (incomingAction.payloadPedalAction_st.triggerCv2_u8) customVibration2_.trigger();
        if (incomingAction.payloadPedalAction_st.triggerCv3_u8) customVibration3_.trigger();
        if (incomingAction.payloadPedalAction_st.triggerCv4_u8) customVibration4_.trigger();
      }

      uint8_t systemControlEvent;
      if (xQueueReceive(s_systemControlQueue, &systemControlEvent, 0) == pdPASS) {
        if (systemControlEvent == 1) { // 1 = OTA Start / Stop Motor
            local_OTA_status_b = true;
        }
      }

      // if new data package is available, update the local config
      if (xQueueReceive(s_configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS)
      {
        dap_config_pedalUpdateTask_st = configPackage_st.config_st;
        ActiveSerial->printf("[pedalTask] debugFlags0=%d\n",
            dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8);

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }

        ActiveSerial->println("Update config: pedal update task");



        // update the calc params
        ActiveSerial->println("Updating the calc params");
        //ActiveSerial->print("save to eeprom tag:");
        //ActiveSerial->println(dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8);
        saveToEEPRomDuration = millis();
        
        if (true == dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8)
        {
          dap_config_pedalUpdateTask_st.payloadHeader_st.storeToEeprom_u8 = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
          uint16_t crc = checksumCalculator_u16((uint8_t*)(&(dap_config_pedalUpdateTask_st.payloadHeader_st)), sizeof(dap_config_pedalUpdateTask_st.payloadHeader_st) + sizeof(dap_config_pedalUpdateTask_st.payloadPedalConfig_st));
          dap_config_pedalUpdateTask_st.payloadFooter_st.checkSum_u16 = crc;
          global_dap_config_class.setConfig(dap_config_pedalUpdateTask_st);
          ActiveSerial->println("Saving into EEPROM");
          global_dap_config_class.storeConfigToEeprom();
          
          saveToEEPRomDuration = 0;
        }
        
        updatePedalCalcParameters(dap_config_pedalUpdateTask_st); // update the calc parameters
        moveSlowlyToPosition_b = true;

        // enable/disable step loss recovery and crash
        stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.stepLossFunctionFlags_u8);
        stepper->configSetProfilingFlag( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) );

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8) )
        {
          ActiveSerial->println("Set clear alarm history flag");
          stepper->clearAllServoAlarms();
          delay(1000); // makes sure the routine has finished

          DapConfig_t tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payloadPedalConfig_st.debugFlags0_u8 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8); // clear the debug bit
          //global_dap_config_class.setConfig(tmp);

