ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
      }
      // end profiler 4, movement strategy
      profiler_pedalUpdateTask.end(5);

      // start profiler 6, ...
      profiler_pedalUpdateTask.start(6);

      // clip target position to hard endstops
      Position_Next_fl32 = constrain(Position_Next_fl32, stepper->getHardEndstopMinPosition(), stepper->getHardEndstopMaxPosition());
      Position_Next = Position_Next_fl32;
      
      // rudder helper
      Rudder_real_poisiton= 100.0f*((float)(positionWithoutEffect-dap_calculationVariables_st.stepperPosMinDefault_i32) / dap_calculationVariables_st.stepperPosRangeDefault_fl32);

      dap_calculationVariables_st.currentPedalPosition_u32 = positionWithoutEffect;
      dap_calculationVariables_st.currentPedalPositionRatio_fl32=((float)(dap_calculationVariables_st.currentPedalPosition_u32-dap_calculationVariables_st.stepperPosMinDefault_i32))/((float)dap_calculationVariables_st.stepperPosRangeDefault_fl32);
      //Rudder initialzing and de initializing
      #ifdef ESPNOW_Enable
        if(dap_calculationVariables_st.rudderStatus_b)
        {
          if(Rudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            /*
            ActiveSerial->print("current position ratio: ");
            ActiveSerial->print(dap_calculationVariables_st.currentPedalPositionRatio_fl32);
            ActiveSerial->print(" ,currentPedalPosition_u32: ");
            ActiveSerial->print(dap_calculationVariables_st.currentPedalPosition_u32);
            ActiveSerial->print(" ,stepperPosMinDefault_i32: ");
            ActiveSerial->print(dap_calculationVariables_st.stepperPosMinDefault_i32);
            ActiveSerial->print(" ,stepperPosRangeDefault_fl32: ");
            ActiveSerial->println(dap_calculationVariables_st.stepperPosRangeDefault_fl32);
            */
            //ActiveSerial->println("moving to center");

          }
          if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                Rudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("Rudder initialized");
                dap_calculationVariables_st.isRudderInitialized_b=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
              }
            }
            

          }
        }
        if(Rudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
          //ActiveSerial->println("moving to min end stop");
        }
        if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          Rudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("Rudder deinitialized");
          dap_calculationVariables_st.isRudderInitialized_b=false;
        }
        //helicopter rudder initialzied
        if(dap_calculationVariables_st.helicopterRudderStatus_b)
        {
          if(HeliRudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to center");
          }
          if(HeliRudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                HeliRudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("HeliRudder initialized");
                dap_calculationVariables_st.isHelicopterRudderInitialized_b=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melodyAirwolfTheme, sizeof(melodyAirwolfTheme)/sizeof(melodyAirwolfTheme[0]),melodyAirwolfThemeDuration);
              }
            }
          }
        }
        if(HeliRudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to min end stop");
        }
        if(HeliRudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          HeliRudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("HeliRudder deinitialized");
          dap_calculationVariables_st.isHelicopterRudderInitialized_b=false;
        }
      #endif

      

      // if pedal in min position, recalibrate position --> automatic step loss compensation
      // stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.stepLossFunctionFlags_u8);
      if( (stepper->getLifelineSignal()==true) && (stepper->servoStatus==SERVO_CONNECTED) )
      {
        //if (stepper->isAtMinPos())
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(local_OTA_status_b==false)
            {
              stepper->correctPos();
            }
          #else
            stepper->correctPos();
          #endif
        }
      }
      

      


      // stop movement, when OTA is in progres
      bool doMovement_b = true;
      #if defined(OTA_update_ESP32) || defined(OTA_update)
        if(local_OTA_status_b==true)
        {
          doMovement_b = false;
        } 
      #endif

      // Move to new position
      if (doMovement_b)
      {
        if (!moveSlowlyToPosition_b)
        {
          static float Position_Last_fl32 = 0.0f;
          static int32_t s_lastCommandedTarget_i32 = -1;
          static uint32_t s_lastCommandedSpeed_u32 = 0;

          // compute required speed to reach the target position within the next control cycle, so that the movement appears smooth and without delay.
          // float distanceToMove = Position_Next_fl32 - (float)stepperPosCurrent_i32;
          float distanceToMove = Position_Next_fl32 - Position_Last_fl32;
          Position_Last_fl32 = Position_Next_fl32;

