ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                  if (stepper != nullptr) {
                      stepper->scheduleServoModbusCmd(cmd);
                  }

                  // WRITE: send ACK immediately (fire-and-forget).
                  // READ:  ACK with value is sent below when the result is ready.
                  if (cmd.isWrite_b) {
                      DapAttrPacket_t ack = attr_pkt;
                      ack.cmdType_u8 = (uint8_t)DAP_ATTR_CMD_ACK;
                      VendorHID_SendAttrReply(&ack);
                  }
              }
            } // while VendorHID_ReadAttrPacket

          // Poll for pending servo Modbus READ results and forward to PC.
          if (stepper != nullptr) {
              uint16_t addr    = 0;
              int16_t  vals[8] = {};
              uint8_t  cnt     = 0;
              if (stepper->tryGetServoModbusReadResult(addr, vals, cnt)) {
                  for (uint8_t i = 0; i < cnt; i++) {
                      DapAttrPacket_t reply = {};
                      reply.cmdType_u8  = (uint8_t)DAP_ATTR_CMD_ACK;
                      reply.classId_u8  = (uint8_t)DAP_ATTR_CLASS_SERVO_MODBUS;
                      reply.attrId_u16  = (uint16_t)(addr + i);
                      reply.value_i64   = (int64_t)vals[i];
                      VendorHID_SendAttrReply(&reply);
                  }
              }
          }
          }
          #endif // USE_VENDOR_HID

          // Activate profiler based on config
          profiler_serialCommunicationTask.start(0);

          // --- 1. Read all available data into our buffer ---
          #ifdef USE_VENDOR_HID
            {
              size_t pktLen = RX_BUFFER_SIZE - buffer_len;
              if (pktLen > 0 && VendorHID_ReadPacket(&rx_buffer[buffer_len], &pktLen)) {
                buffer_len += pktLen;
              }
            }
          #else
            if (ActiveSerial->available())
            {
              size_t bytesToRead = min((size_t)ActiveSerial->available(), RX_BUFFER_SIZE - buffer_len);
              if (bytesToRead > 0)
              {
                  ActiveSerial->readBytes(&rx_buffer[buffer_len], bytesToRead);
                  buffer_len += bytesToRead;
              }
            }
          #endif

          // --- 2. Process all complete packets in the buffer ---
          size_t buffer_idx = 0;
            while (buffer_idx < buffer_len)
            {
              // A. Find the next valid Start-of-Frame (SOF)
              if (rx_buffer[buffer_idx] != SOF_BYTE_0_U8 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1_U8))
              {
                  buffer_idx++;
                  continue; // Keep scanning for a SOF
              }

              // ActiveSerial->println("1st check passed");

              // SOF found at buffer_idx. Check if we have enough data for a header.
                if (buffer_len < buffer_idx + 3)
                {
                  // Not enough data for a full header, stop parsing for now
                  break;
              }

              // B. Get expected packet size from payload type
              uint8_t payloadType = rx_buffer[buffer_idx + 2];
              size_t expectedSize = getExpectedPacketSize(payloadType);

                if (expectedSize == 0)
                {
                  // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
                  buffer_idx++;
                  continue;
              }

              // ActiveSerial->println("2nd check passed");

              // C. Check if the full packet has arrived
                if (buffer_len < buffer_idx + expectedSize)
                {
                  // Full packet is not yet in the buffer, wait for more data
                  break;
              }

              // D. Check for valid End-of-Frame (EOF)
                if (rx_buffer[buffer_idx + expectedSize - 2] != EOF_BYTE_0_U8 || rx_buffer[buffer_idx + expectedSize - 1] != EOF_BYTE_1_U8)
                {
                  // EOF is wrong, this packet is corrupt. Skip the SOF and continue scanning.
                  buffer_idx++;
                  continue;
              }
              
              // --- We have a candidate packet! Now validate and process it. ---
              uint8_t* packet_start = &rx_buffer[buffer_idx];
              bool structIsValid = true;
              uint16_t received_crc = 0;
              uint16_t calculated_crc = 0;

              switch (payloadType) {
                  case DAP_PAYLOAD_TYPE_CONFIG_U8: {
                      DapConfig_t received_config;
                      memcpy(&received_config, packet_start, sizeof(DapConfig_t));
                      
                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_config.payloadHeader_st)), sizeof(received_config.payloadHeader_st) + sizeof(received_config.payloadPedalConfig_st));
                      received_crc = received_config.payloadFooter_st.checkSum_u16;

                        if (calculated_crc != received_crc || received_config.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
                        {
                          structIsValid = false;
                        }
                        else
                        {
                          // --- VALID CONFIG PACKET ---
                        ActiveSerial->println("Updating pedal config from serial");
                        //global_dap_config_class.setConfig(received_config);

                        configDataPackage_t configPackage_st;
                        configPackage_st.config_st = received_config;
                        xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
                        
                        if (received_config.payloadHeader_st.storeToEeprom_u8 == 1)
                        {
                          Buzzer.single_beep_tone(700, 100);
                        }
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_U8: {
                      DapActions_t received_action;
                      memcpy(&received_action, packet_start, sizeof(DapActions_t));

                      // ActiveSerial->println("Action received");

                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_action.payloadHeader_st)), sizeof(received_action.payloadHeader_st) + sizeof(received_action.payloadPedalAction_st));
                      received_crc = received_action.payloadFooter_st.checkSum_u16;

