ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                            }
                          #endif
                          
                          

                          
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
                    ActiveSerial->println("Get OTA command");
                    buzzerBeepAction_b=true;

                    //ActiveSerial->readBytes((char*)&dap_action_ota_st, sizeof(DapActionOta_t));
                    #ifdef OTA_update
                      if(dap_action_ota_st.payloadHeader_st.payloadType_u8==DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
                      {
                        if(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == sct_dap_config_st.payloadPedalConfig_st.pedalType_u8)
                        {
                          g_SSID=new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8+1];
                          g_PASS=new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8+1];
                          memcpy(g_SSID,dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8,dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
                          memcpy(g_PASS,dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8,dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
                          g_SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8]=0;
                          g_PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8]=0;
                          g_OTA_enable_b=true;
                          g_OTA_enable_start=true;
                          #ifdef ESPNOW_Enable
                            g_ESPNow_OTA_enable=false;
                          #endif
                        }
                      }
                    #else
                      ActiveSerial->println("The command is not supported");
                    #endif    
                    break;
                }

                  
              } // end switch

                if (!structIsValid)
                {
                  ActiveSerial->printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                  buffer_idx++; // Skip the failed SOF and continue scanning
                }
                else
                {
                  // Packet was valid and processed, advance index past this packet
                  buffer_idx += expectedSize;
              }
          } // end while

          // --- 3. Clean up the buffer ---
              if (buffer_idx > 0)
              {
              size_t remaining_len = buffer_len - buffer_idx;
                if (remaining_len > 0)
                {
                  memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
              }
              buffer_len = remaining_len;
          }

          profiler_serialCommunicationTask.end(0);
          profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}



uint32_t communicationTask_stackSizeIdx_u32 = 0;
// tud_cdc_write / tud_cdc_write_flush / tud_cdc_write_available are needed
// for batched CDC TX under USE_VENDOR_HID.  The TinyUSB header is already
// pulled in by Adafruit_TinyUSB via Controller.h when USE_VENDOR_HID is
// defined; include it here unconditionally so the TX task always compiles.
#ifdef USE_VENDOR_HID
  #include "tusb.h"
  #include "esp32-hal-tinyusb.h"  // usb_persist_restart / restart_type_t
#endif

void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  // FunctionProfiler profiler_serialCommunicationTask;
  // profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  // profiler_serialCommunicationTask.setNumberOfCalls(500);

  // static DapConfig_t sct_dap_config_st;

  PedalStatePackage_t receivedState;

  #ifdef USE_VENDOR_HID
  // Batch TX: accumulate bytes across queue wakeups; write to USB only once
  // TX_WRITE_THRESHOLD bytes have built up (~40 items = ~10 ms of 4 kHz data).
  // This limits USB OTG flushes to ~100/s, preventing them from delaying the
  // stepper timer ISR (rough pedal feel), while keeping the task immediately
  // responsive to new queue items so config/action replies are not blocked.
  // batchLen persists across wakeups and resets only after each write.
  static const size_t TX_WRITE_THRESHOLD =
      40u * (sizeof(DapStateBasic_t) + sizeof(DapStateExtended_t));
  static uint8_t txBatch[60u * (sizeof(DapStateBasic_t) + sizeof(DapStateExtended_t))];
  size_t batchLen = 0;
  #endif

  for (;;)
  {
    // Block until at least one item is available.
    if (xQueueReceive(s_pedalStateQueue, &receivedState, portMAX_DELAY) == pdPASS)
    {
      // Drain all items currently in the queue into the batch buffer.
      do {
                
        // Copy to a local variable to calculate CRC
        DapStateBasic_t basic_to_send = receivedState.basic_st;
        DapStateExtended_t extended_to_send = receivedState.extended_st;



  // Provide pedal states to ESPnow task
  #ifdef ESPNOW_Enable
        // update pedal states
        if (s_semaphore_updatePedalStates != NULL)
        {
          if (xSemaphoreTake(s_semaphore_updatePedalStates, (TickType_t)0) == pdTRUE)
          {
            // move local structure values to global structures
            dap_state_basic_st = basic_to_send;
            dap_state_extended_st = extended_to_send;

            // release semaphore
            xSemaphoreGive(s_semaphore_updatePedalStates);
          }
        }
        else
        {
          s_semaphore_updatePedalStates = xSemaphoreCreateMutex();
        }
  #endif



        // send basic pedal state struct
        if (receivedState.sendBasicFlag_b)
        {
          basic_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(basic_to_send.payloadHeader_st)), sizeof(basic_to_send.payloadHeader_st) + sizeof(basic_to_send.payloadPedalStateBasic_st));
          #ifdef USE_VENDOR_HID
          // Accumulate into batch buffer; sent as one block after the queue is drained.
          if (batchLen + sizeof(DapStateBasic_t) <= sizeof(txBatch))
          {
            memcpy(&txBatch[batchLen], &basic_to_send, sizeof(DapStateBasic_t));
            batchLen += sizeof(DapStateBasic_t);
          }
          #else
          #ifdef USE_CDC_INSTEAD_OF_UART
          if (ActiveSerial->availableForWrite() >= (int)sizeof(DapStateBasic_t))
          #endif
          {
            ActiveSerial->write((char*)&basic_to_send, sizeof(DapStateBasic_t));
          }
          #endif
        }

        // send extended pedal state struct
        if (receivedState.sendExtendedFlag_b)
        {
          extended_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(extended_to_send.payloadHeader_st)), sizeof(extended_to_send.payloadHeader_st) + sizeof(extended_to_send.payloadPedalStateExtended_st));
          #ifdef USE_VENDOR_HID
          // Accumulate into batch buffer; sent as one block after the queue is drained.
          if (batchLen + sizeof(DapStateExtended_t) <= sizeof(txBatch))
          {
            memcpy(&txBatch[batchLen], &extended_to_send, sizeof(DapStateExtended_t));
            batchLen += sizeof(DapStateExtended_t);
          }
          #else
          // Guard: only write when the full struct fits in the CDC TX buffer.
          // Without this, Serial.write() can block for many ms when the USB host
          // has not yet consumed previous data, stalling the serialCommunicationTaskTx
          // and disrupting system timing. Dropped packets are tolerated for logging;
          // V6 (hardware UART) is non-blocking and does not need this guard.
          #ifdef USE_CDC_INSTEAD_OF_UART
          if (ActiveSerial->availableForWrite() >= (int)sizeof(DapStateExtended_t))
          #endif
          {
            ActiveSerial->write((char*)&extended_to_send, sizeof(DapStateExtended_t));
          }
          #endif
        }

      // Drain done.
      } while (xQueueReceive(s_pedalStateQueue, &receivedState, (TickType_t)0) == pdPASS);

