ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
      // Write only when the accumulated batch reaches the threshold (~100 Hz).
      // batchLen is NOT reset on passes below the threshold so bytes continue
      // accumulating until the next threshold crossing.
      #ifdef USE_VENDOR_HID
      if (batchLen >= TX_WRITE_THRESHOLD)
      {
        int available = ActiveSerial->availableForWrite();
        if (available == 0)
        {
          // CDC buffers are running full (e.g. host not reading).
          // Drop the accumulated batch to prevent memory buildup and potential restart.
          batchLen = 0;
        }
        else
        {
          size_t toWrite = ((size_t)available < batchLen) ? (size_t)available : batchLen;
          size_t written = ActiveSerial->write(txBatch, toWrite);

          if (written < batchLen)
          {
            // TinyUSB TX FIFO was not large enough for the full batch.
            // Keep the unsent bytes at the front so they are sent next cycle.
            memmove(txBatch, txBatch + written, batchLen - written);
            batchLen -= written;
          }
          else
          {
            batchLen = 0;
          }
        }
      }
      #endif
    }
  }
}

//OTA multitask

void otaUpdateTask( void * pvParameters )
{
  uint16_t OTA_count = 0;
  unsigned long ota_debug_messaage_last = 0;
  bool message_out_b = false;
  int OTA_update_status = 99;

  for (;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {

      if (OTA_count > 200)
      {
        message_out_b = true;
        OTA_count = 0;
      }
      else
      {
        OTA_count++;
      }

      #if defined(OTA_update)  || defined(OTA_update_ESP32)
      if(g_OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("OTA enable flag on");
        }
        if(g_OTA_status)
        {
          #ifdef OTA_update_ESP32
            server.handleClient();
          #endif
          #ifdef OTA_update
            if(OTA_update_status==0)
            {
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
              ESP.restart();
            }
            else
            {
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
              {
                //updload ota from platformio
                //sendESPNOWLog("Upload from platformIO");
                ArduinoOTA.handle(); 
                if(millis()-ota_debug_messaage_last>1000)
                {
                  ActiveSerial->println("Wait for ota update...");
                }
                
              }
              else
              {
                //show ota error
                Buzzer.single_beep_tone(770,100);
                #ifdef USING_LED
                  pixels.setPixelColor(0,0xff,0x00,0x00);//red
                  pixels.show(); 
                  delay(500);
                  pixels.setPixelColor(0,0x00,0x00,0x00);//no color
                  pixels.show();
                  delay(500);    
                #endif 
              }

            }

          #endif
          

        }
        else
        {
          esp_err_t result;
          ActiveSerial->println("de-initialize espnow");
          ActiveSerial->println("wait...");
          #ifdef ESPNOW_Enable
            sendESPNOWLog("OTA enabled, de-initialize espnow");
            sendESPNOWLog("wait...");
            delay(1000);
            result= esp_now_deinit();
            g_ESPNow_initial_status=false;
            g_ESPNOW_status=false;
          #else
            result = ESP_OK;
          #endif
          //result = ESP_OK;
          delay(3000);
          if(result==ESP_OK)
          {
            g_OTA_status=true;
            
            // notify pedal task to stop movement
            uint8_t ota_event = 1;
            xQueueSend(s_systemControlQueue, &ota_event, (TickType_t)0);

            Buzzer.single_beep_tone(700,100); 
            delay(1000);
            #ifdef OTA_update_ESP32
            ota_wifi_initialize(g_apHost_pc);
            #endif
            #ifdef USING_LED
                //pixels.setBrightness(20);
                pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
                pixels.show(); 
                //delay(3000);
            #endif
            #ifdef OTA_update
            wifi_initialized(g_SSID,g_PASS);
            delay(2000);
            //sendESPNOWLog("Wifi Connected");
            if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8!=OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
            {
              ESP32OTAPull ota;
              int ret;
              ota.SetCallback(OTAcallback);
              ota.OverrideBoard(CONTROL_BOARD);
              char* versionTag_pc;
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_FORCE_UPDATE)
              {
                const char* versionTagSource_pc;
                if(PCB_VERSION==3||PCB_VERSION==5||PCB_VERSION==9) versionTagSource_pc ="0.90.16";// for those board which change the partition table
                else versionTagSource_pc ="0.0.0";
                versionTag_pc=new char[strlen(versionTagSource_pc) + 1];
                strcpy(versionTag_pc, versionTagSource_pc);
                ActiveSerial->println("Force update");
              }
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_NORMAL)
              {
                versionTag_pc=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
                strcpy(versionTag_pc, DAP_FIRMWARE_VERSION);
                //version_tag=DAP_FIRMWARE_VERSION;
              }
              switch (dap_action_ota_st.payloadOtaInfo_st.modeSelect_u8)
              {
                case 1:
                  ActiveSerial->printf("Flashing to latest release, checking %s to see if an update is available...\n", OTA_JSON_URL_MAIN);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_MAIN, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 2:
                  ActiveSerial->printf("Flashing to latest dev build, checking %s to see if an update is available...\n", OTA_JSON_URL_DEV);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_DEV, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 3:
                  ActiveSerial->printf("Flashing to test build, checking %s to see if an update is available...\n", OTA_JSON_URL_TEST);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_TEST, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                default:
                break;
                delete[] versionTag_pc; 
              }
            }  
            else
            {
              // initialize ota for platformIO upload
              ActiveSerial->println("OTA from platformIO");
              ota_arduinoota_initialize();
            }         
            #endif
            delay(3000);
          }

