ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
            //Debug_rudder_last=now_rudder;
             //ActiveSerial->println(dap_calculationVariables_st.currentPedalPosition_u32);                  
                
            print_count=0;
          }
          else
          {
            print_count++;
                
          } 
              
                  
        #endif



      }

      profiler_espNow.end(0);

      // print profiler results
      profiler_espNow.report();

      // force a context switch
		taskYIELD();
    }
}
#endif


void miscTask( void * pvParameters )
{
  static DapConfig_t misc_dap_config_st;
  // for the task no need complete asap, ex buzzer, led 
  for(;;)
  {
    // Detect esptool's 1200bps upload-touch by polling TinyUSB's CDC line coding directly.
    // Serial.enableReboot(false) in setup() keeps the native Arduino CDC (COM25) from
    // responding to 1200bps.  The active port while firmware runs is the TinyUSB CDC
    // (COM27, controlled by Adafruit_USBD_CDC), which is a separate class that does NOT
    // forward to USBCDC::_onLineCoding, so Serial.enableReboot(true) would have no effect
    // on COM27.  Instead, poll tud_cdc_n_get_line_coding() here every 50ms after the 5s
    // startup guard.  When esptool sets 1200bps, usb_persist_restart(RESTART_BOOTLOADER)
    // enters ROM download mode so the upload completes without pressing BOOT+RESET.
    #if defined(USE_CDC_INSTEAD_OF_UART) && defined(USE_VENDOR_HID)
    {
      static bool s_rebootEnabled_b = false;
      if (!s_rebootEnabled_b && millis() > 5000) {
        s_rebootEnabled_b = true;
      }
      if (s_rebootEnabled_b && tud_mounted()) {
        cdc_line_coding_t lc = {};
        tud_cdc_n_get_line_coding(0, &lc);
        if (lc.bit_rate == 1200) {
          usb_persist_restart(RESTART_BOOTLOADER);
        }
      }
    }
    #endif

    global_dap_config_class.getConfig(&misc_dap_config_st, 500);
    
    #ifdef ESPNOW_Enable
      //software assignment
      if(assignmentUpdate_b)
      {
        assignmentUpdate_b = false;
        writeAssignmentToEeprom();
        delay(1000);
        //restart after aassignment
        ESP.restart();
      }
      if (assignmentClear_b)
      {
        assignmentClear_b = false;
        clearAssignmentToEeprom();
        delay(1000);
        // restart after aassignment
        ESP.restart();
      }
#endif
    // make buzzer sound actions here
    #ifdef ESPNOW_Enable
      if (Config_update_Buzzer_b)
      {
        Buzzer.single_beep_tone(700, 50);
        Config_update_Buzzer_b = false;
      }
      if (assignmentUpdateBuzzer_b)
      {
        ActiveSerial->println("Beep");
        Buzzer.single_beep_tone(700, 50);
        assignmentUpdateBuzzer_b = false;
      }
      if(buzzerBeepAction_b)
      {
        Buzzer.single_beep_tone(700,50);
        buzzerBeepAction_b=false;
      }
    #endif
    #if defined(OTA_update) && defined(USING_BUZZER)
      if(g_beepForOtaProgress)
      {
        Buzzer.single_beep_tone(700,50);
        g_beepForOtaProgress=false;
      }
    #endif
    delay(50);
  }
}

